/*
 * @Date: 2019-07-14 19:12:42
 * @LastEditors: Please set LastEditors
 * @LastEditTime: 2019-08-22 14:55:45
 * @Description:
 */
import { Notification } from 'element-ui'

const state = () => ({
  sort: [],
  articlelist: [],
  say: [],
  audio: [{
    name: '以父之名',
    artist: '周杰伦',
    url: 'http://qiniu.xl686.com/yfzm.mp3',
    cover: 'http://qiniu.xl686.com/yfzm.jpg',
    lrc: '[00:00.000] 作曲 : 周杰伦\n[00:01.000] 作词 : 黄俊郎\n[01:26.95]微凉的晨露沾湿黑礼服\n[01:29.71]石板路有雾父在低诉\n[01:32.38]无奈的觉悟只能更残酷\n[01:35.23]一切都为了通往圣堂的路\n[01:37.82]吹不散的雾隐没了意图\n[01:40.59]谁轻柔踱步停住\n[01:42.96]还来不及哭穿过的子弹就带走温度\n[01:47.61]\n[01:48.50]我们每个人都有罪\n[01:50.12]犯着不同的罪\n[01:51.51]我能决定谁对\n[01:52.93]谁又该要沉睡\n[01:54.30]争论不能解决\n[01:55.64]在永无止境的夜\n[01:57.07]关掉你的嘴\n[01:58.40]唯一的恩惠\n[01:59.49]挡在前面的人都有罪\n[02:01.06]后悔也无路可退\n[02:02.46]以父之名判决\n[02:03.77]那感觉没有适合词汇\n[02:05.39]就像边笑边掉泪\n[02:06.80]凝视着完全的黑\n[02:08.10]阻挡悲剧蔓延的悲剧会让我沉醉\n[02:10.60]低头亲吻我的左手\n[02:11.91]换取被宽恕的承诺\n[02:13.33]老旧管风琴在角落\n[02:14.66]一直一直一直伴奏\n[02:16.14]黑色帘幕被风吹动\n[02:17.58]阳光无言地穿透\n[02:18.96]洒向那群被我驯服后的 兽\n[02:21.87]沉默地喊叫沉默地喊叫\n[02:23.11]孤单开始发酵\n[02:24.36]不停对着我嘲笑\n[02:25.82]回忆逐渐燃烧\n[02:27.20]曾经纯真的画面\n[02:28.49]残忍地温柔出现\n[02:29.87]脆弱时间到\n[02:31.04]我们一起来祷告\n[02:32.68]仁慈的父我已坠入\n[02:35.55]看不见罪的国度\n[02:38.19]请原谅我的自负\n[02:41.59]\n[02:43.63]没人能说没人可说\n[02:46.47]好难承受\n[02:48.39]荣耀的背后刻着一道孤独\n[02:52.41]\n[02:54.69]闭上双眼我又看见\n[02:57.49]当年那梦的画面\n[03:00.17]天空是蒙蒙的雾\n[03:03.51]\n[03:05.63]父亲牵着我的双手\n[03:08.53]轻轻走过\n[03:10.42]清晨那安安静静的石板路\n[03:14.11]\n[03:46.26]低头亲吻我的左手\n[03:47.79]换取被宽恕的承诺\n[03:49.20]老旧管风琴在角落\n[03:50.56]一直一直一直伴奏\n[03:51.86]黑色帘幕被风吹动\n[03:53.45]阳光无言地穿透\n[03:54.77]洒向那群被我驯服后的 兽\n[03:57.51]沉默地喊叫沉默地喊叫\n[03:58.84]孤单开始发酵\n[04:00.23]不停对着我嘲笑\n[04:01.55]回忆逐渐燃烧\n[04:02.92]曾经纯真的画面\n[04:04.27]残忍地温柔出现\n[04:05.73]脆弱时间到\n[04:06.80]我们一起来祷告\n[04:08.55]仁慈的父我已坠入\n[04:11.22]看不见罪的国度\n[04:13.99]请原谅我的自负\n[04:16.68]\n[04:19.39]没人能说没人可说\n[04:22.24]好难承受\n[04:24.14]荣耀的背后刻着一道孤独\n[04:28.14]\n[04:30.83]仁慈的父我已坠入\n[04:35.96]看不见罪的国度\n[04:41.39]请原谅我的自负\n[04:47.11]刻着一道孤独\n[04:52.16]仁慈的父我已坠入\n[04:55.16]看不见罪的国度\n[04:57.82]请原谅我的自负\n[05:01.05]\n[05:03.15]没人能说没人可说\n[05:06.08]好难承受\n[05:07.96]荣耀的背后刻着一道孤独\n[05:13.38]\n[05:14.20]那斑驳的家徽 我擦拭了一夜(闭上双眼我又看见)\n[05:16.91]孤独的光辉 我才懂的感觉(当年那梦的画面)\n[05:19.59]烛光 不 不 停的 摇晃(天空是蒙蒙的雾)\n[05:22.50]猫头鹰在 窗棂上 对著远方眺望\n[05:25.11]通向 大厅的长廊 (父亲牵着我的双手)\n[05:27.91]一样 说不出的沧桑(轻轻走过)\n[05:30.63]没有喧嚣 只有宁静围绕(清晨那安安静静的石板路)\n[05:33.19]我 慢慢睡著 天 刚刚破晓\n'
  }]
})

const mutations = {
  getSort(state, payload) {
    state.sort = payload
  },
  getArticleList(state, payload) {
    state.articlelist = payload
  },
  getSay(state, payload) {
    state.say = payload
  },
  addAudio(state, payload) {
    Notification({
      title: '添加成功！',
      dangerouslyUseHTMLString: true,
      message: `<span style='color:red,fontWeight:bold'>${payload.name}</span> 已成功加入播放列表`,
      type: 'success',
      position: 'bottom-right'
    })
    state.audio.push(payload)
  }
}

const actions = {
  async asyncGetSort({ commit }) {
    const sort = await this.$axios.get('/api/hades/sort')
    commit('getSort', sort)
  },
  async asyncGetArticleList({ commit }) {
    const articlelist = await this.$axios.get('/api/hades/articlelist')
    commit('getArticleList', articlelist)
  },
  async asyncGetSay({ commit }) {
    const say = await this.$axios.get('/api/hades/saying')
    commit('getSay', say)
  }
}

export default {
  namespaced: true,
  state,
  mutations,
  actions
}
